PUBLIC	Znk

;title    "íÏÎÉÔÏÒ úÎÁËÏÇÅÎÅÒÁÔÏÒ"
module  MonDD30

org	0E800h

SECTION 	kp04_DD30

include  "AdrIO.inc"

Znk:		;	æÏÎÔ ÐÏ	ÕÍÏÌÞÁÎÉÀ ÒÁÚÍÅÒÏÍ 1ë
		db 0, 0, 0, 0,	0, 0, 0, 0, 0Fh, 0Fh, 0Fh, 0Fh,	0, 0, 0
		db 0, 0F0h, 0F0h, 0F0h, 0F0h, 0, 0, 0,	0, 0FFh, 0FFh
		db 0FFh, 0FFh,	0, 0, 0, 0, 0, 0, 0, 0,	0F0h, 0F0h, 0F0h
		db 0F0h, 0Fh, 0Fh, 0Fh, 0Fh, 0F0h, 0F0h, 0F0h,	0F0h, 0F0h
		db 0F0h, 0F0h,	0F0h, 0F0h, 0F0h, 0F0h,0F0h, 0FFh, 0FFh
		db 0FFh, 0FFh,	0F0h, 0F0h, 0F0h, 0F0h,	0, 0, 0, 0, 0
		db 0, 0, 0, 018h, 0FFh,099h, 018h, 018h, 024h, 042h, 0C3h
		db 0, 0, 0, 0,	0, 0, 0, 0, 018h, 03Ch, 07Eh, 0FFh, 018h, 018h
		db 018h, 018h, 0, 0, 0, 0, 0, 0,0, 0, 0, 0, 0, 0, 0, 0
		db 0, 0, 010h, 030h, 070h, 0FFh, 0FFh, 070h, 030h, 010h, 018h
		db 018h, 018h, 018h, 0FFh, 07Eh, 03Ch, 018h,	0, 0, 0, 0, 0Fh
		db 0Fh, 0Fh, 0Fh, 0Fh,	0Fh, 0Fh, 0Fh, 0Fh, 0Fh, 0Fh, 0Fh
		db 0F0h, 0F0h,	0F0h, 0F0h, 0Fh, 0Fh, 0Fh, 0Fh,	0FFh, 0FFh
		db 0FFh, 0FFh,	0Fh, 0Fh, 0Fh, 0Fh, 0, 0, 0, 0,	0FFh, 0FFh
		db 0FFh, 0FFh,	0Fh, 0Fh, 0Fh, 0Fh, 0FFh, 0FFh,	0FFh, 0FFh
		db 0F0h, 0F0h,	0F0h, 0F0h, 0FFh, 0FFh,	0FFh, 0FFh, 0FFh
		db 0FFh, 0FFh,	0FFh, 0FFh, 0FFh, 0FFh,	0FFh, 0, 0, 0
		db 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0
		db 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0
		db 0, 0, 0, 8,	0Ch, 0Eh, 0FFh,	0FFh, 0Eh, 0Ch,	8, 0, 0
		db 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0
		db 0, 0, 0, 0,	0, 8, 8, 8, 8, 8, 0, 8,	0, 014h,014h, 014h
		db 0, 0, 0, 0,	0, 014h,014h, 03Eh, 014h, 03Eh, 014h, 014h, 0
		db 8, 03Ch, 0Ah, 01Ch, 028h, 01Eh,	8, 0, 026h, 026h,010h, 8
		db 4, 032h, 032h, 0, 8, 014h, 014h, 0Ch, 02Ah, 012h,	02Ch, 0
		db 0Ch, 0Ch, 4, 0, 0, 0, 0, 0,	010h, 8,	4, 4, 4, 8, 010h
		db 0, 4, 8, 010h, 010h, 010h, 8, 4, 0, 0,	8, 02Ah,	01Ch, 02Ah
		db 8, 0, 0, 0,	8, 8, 03Eh, 8, 8, 0, 0, 0, 0, 0,	0, 0Ch
		db 0Ch, 4, 0, 0, 0, 0,	03Eh, 0,	0, 0, 0, 0, 0, 0, 0, 0
		db 0Ch, 0Ch, 0, 020h, 020h, 010h,	8, 4, 2, 2, 0, 01Ch, 022h
		db 032h, 02Ah, 026h, 022h,	01Ch, 0,	8, 0Ch,	8, 8, 8, 8, 01Ch
		db 0, 01Ch, 022h, 020h, 018h, 4, 2, 03Eh, 0, 03Eh, 020h, 010h
		db 018h, 020h, 022h, 01Ch,	0, 010h,	018h, 014h, 012h, 03Eh, 010h
		db 010h, 0, 03Eh, 2, 01Eh, 020h, 020h, 022h,	01Ch, 0,	038h, 4
		db 2, 01Eh, 022h, 022h, 01Ch, 0, 03Eh, 020h,	010h, 8,	4, 4, 4
		db 0, 01Ch, 022h, 022h, 01Ch, 022h,	022h, 01Ch, 0, 01Ch, 022h
		db 022h, 03Ch, 020h, 010h,	0Eh, 0,	0, 0Ch,	0Ch, 0,	0, 0Ch
		db 0Ch, 0, 0Ch, 0Ch, 0, 0, 0Ch, 0Ch, 4, 0, 010h, 8, 4
		db 2, 4, 8, 010h, 0, 0,	0, 03Eh,	0, 03Eh,	0, 0, 0, 4, 8
		db 010h, 020h, 010h, 8, 4, 0, 01Ch, 022h, 020h, 010h,	8, 0, 8
		db 0, 01Ch, 022h, 020h, 024h, 02Ah,	02Ah, 014h, 0, 8,	014h, 022h
		db 022h, 03Eh, 022h, 022h,	0, 01Eh,	022h, 022h, 01Eh, 022h, 022h
		db 01Eh, 0, 01Ch, 022h, 2, 2, 2, 022h, 01Ch, 0, 0Eh, 012h, 022h
		db 022h, 022h, 012h, 0Eh,	0, 03Eh,	2, 2, 01Eh, 2, 2, 03Eh, 0
		db 03Eh, 2, 2, 01Eh, 2, 2, 2, 0,	01Ch, 022h, 2, 03Ah, 022h
		db 022h, 01Ch, 0, 022h, 022h, 022h,	03Eh, 022h, 022h, 022h, 0
		db 01Ch, 8, 8, 8, 8, 8,	01Ch, 0,	038h, 010h, 010h, 010h, 012h
		db 012h, 0Ch, 0, 022h, 012h, 0Ah,	6, 0Ah,	012h, 022h, 0, 2
		db 2, 2, 2, 2,	2, 03Eh,	0, 022h,	036h, 02Ah, 02Ah, 022h, 022h
		db 022h, 0, 022h, 022h, 026h, 02Ah,	032h, 022h, 022h, 0, 01Ch
		db 022h, 022h, 022h, 022h,	022h, 01Ch, 0, 01Eh, 022h, 022h, 01Eh
		db 2, 2, 2, 0,	01Ch, 022h, 022h, 022h, 02Ah, 012h, 02Ch, 0, 01Eh
		db 022h, 022h, 01Eh, 0Ah,	012h, 022h, 0, 01Ch, 022h, 2, 01Ch
		db 020h, 022h, 01Ch, 0, 03Eh, 8, 8, 8, 8, 8, 8, 0,	022h, 022h
		db 022h, 022h, 022h, 022h,	01Ch, 0,	022h, 022h, 022h, 014h, 014h
		db 8, 8, 0, 022h, 022h, 022h, 02Ah, 02Ah, 02Ah, 014h,	0, 022h
		db 022h, 014h, 8, 014h, 022h, 022h,	0, 022h,	022h, 022h, 014h
		db 8, 8, 8, 0,	03Eh, 020h, 010h, 8, 4, 2,	03Eh, 0,	01Ch, 4
		db 4, 4, 4, 4,	01Ch, 0,	2, 2, 4, 8, 010h, 020h, 020h, 0, 01Ch
		db 010h, 010h, 010h, 010h,	010h, 01Ch, 0, 8,	014h, 022h, 0, 0
		db 0, 0, 0, 0,	0, 0, 0, 0, 0, 03Eh, 0, 012h, 02Ah, 02Ah, 02Eh
		db 02Ah, 02Ah, 012h, 0, 8, 014h, 022h, 022h,	03Eh, 022h, 022h
		db 0, 03Eh, 2, 2, 01Eh, 022h, 022h, 01Eh, 0, 012h, 012h, 012h
		db 012h, 012h, 03Eh, 020h,	0, 018h,	014h, 014h, 014h, 014h, 03Eh
		db 022h, 0, 03Eh, 2, 2, 01Eh, 2, 2, 03Eh, 0, 8, 01Ch, 02Ah
		db 02Ah, 02Ah, 01Ch, 8, 0, 03Eh, 022h, 2, 2, 2, 2, 2, 0, 022h
		db 022h, 014h, 8, 014h, 022h, 022h,	0, 022h,	022h, 032h, 02Ah
		db 026h, 022h, 022h, 0, 02Ah, 022h,	032h, 02Ah, 026h, 022h, 022h
		db 0, 022h, 012h, 0Ah, 6, 0Ah, 012h, 022h,	0, 038h,	024h, 024h
		db 024h, 024h, 024h, 022h,	0, 022h,	036h, 02Ah, 02Ah, 022h, 022h
		db 022h, 0, 022h, 022h, 022h, 03Eh,	022h, 022h, 022h, 0, 01Ch
		db 022h, 022h, 022h, 022h,	022h, 01Ch, 0, 03Eh, 022h, 022h, 022h
		db 022h, 022h, 022h, 0, 03Ch, 022h,	022h, 03Ch, 028h, 024h, 022h
		db 0, 01Eh, 022h, 022h, 01Eh, 2, 2, 2, 0, 01Ch, 022h, 2, 2
		db 2, 022h, 01Ch, 0, 03Eh, 8, 8, 8, 8, 8,	8, 0, 022h, 022h
		db 022h, 03Ch, 020h, 022h,	01Ch, 0,	02Ah, 02Ah, 02Ah, 01Ch, 02Ah
		db 02Ah, 02Ah, 0, 01Eh, 022h, 022h,	01Eh, 022h, 022h, 01Eh, 0
		db 2, 2, 2, 01Eh, 022h, 022h, 01Eh, 0, 022h, 022h, 026h, 02Ah
		db 02Ah, 02Ah, 026h, 0, 01Ch, 022h,	020h, 018h, 020h, 022h, 01Ch
		db 0, 02Ah, 02Ah, 02Ah, 02Ah, 02Ah,	02Ah, 03Eh, 0, 0Eh, 010h
		db 020h, 03Ch, 020h, 010h,	0Eh, 0,	02Ah, 02Ah, 02Ah, 02Ah, 02Ah
		db 03Eh, 020h, 0, 022h, 022h, 022h,	03Eh, 020h, 020h, 020h, 0
		db 03Eh, 03Eh, 03Eh, 03Eh,	03Eh, 03Eh, 03Eh, 0
; €€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
	REPT 1022
		db  0AAh
	ENDR
	we:	db  0E8h,0
		ASSERT	ASMPC <= 0F000h
